Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 他突然想到什么，眼睛一亮，一脸激动的看向沈萤道，“师父是想提醒我，无论什么样的任务，对我说其实都是一种修行方式，不可小看，凡事都要做好万全的准备？师父放心，这点徒儿明白的。”
en_us: Struck with a sudden thought, Yi Qing's eyes lit up, and with a face filled with emotion, turned to look at Shen Ying. "Master is trying to remind me that no matter what kind of task, they are all a form of cultivation practice, so I must treat it seriously and be fully prepared. Have no worries, Master, disciple fully understands your point."

source: 他立马扫视了在场的所有妹子一周，还好还好，没有人顿悟。
en_us: He immediately swept his gaze across all the girls present. Thank goodness, no one had an epiphany.

source: 他立马换上可怜兮兮的表情，用十二万分的认真神情看向沈萤道，“大仙，我真的真的真的真的没有入侵仙界的想法，您放心，我保证马上通知所有魔族，绝对不会有一只魔敢跨出这个大门的。谁跨……我就跺了他的脚！您要相信我啊……”
en_us: He immediately put up a pitiful front and looked towards Shen Ying with a dead serious face. " Great Immortal, I have no intents to covet the Immortal World at all. Rest assured, I promise to impose an order on the Devils and make sure that no Devils will dare to step out of this Gate. Whoever dares to... I'll chop off his legs! You've got to believe me..."

source: 他立马站了起来，脸上仍是带着那副惊喜过后，不敢置信的表情，脚步带飘的走进了厨房。
en_us: Still wearing an expression of delight and disbelief on his face, he stood up immediately and entered the kitchen with light-hearted footsteps.

source: 他等了半会，才传来一声清冷的传音，“走。”
en_us: He waited for a moment, then a cold voice said, "Go."

source: 他紧紧的盯着地上的灵草，没看到还好，看到了现在就算是硬抢，也不能让这宝贝从眼前溜走。
en_us: He stared at the Vegetation Spirit standing on the ground. Now that he knew they had a Vegetation Spirit, he couldn't leave without it. Even if he had to snatch it from the Blackheaven Sect, he would.

source: 他细看了一眼毫无形象趴在石桌上，流着口水睡得呼噜噜响的人。她身上仍是没有半点灵气的痕迹，看起来就是个弱不经风的凡人。出现这种情况有两种可能，一，她就是个凡人；二，她的修为过高，可能已到化神，甚至更高的境界。所以达到了返朴归真的程度，灵气收放自如，等闲之人根本看不出来。
en_us: He took a closer look at the person laying on the stone table, dripping saliva and snoring soundly, who did not seem so impressive. She still did not show any signs of possessing Spirit Qi, appearing just like a feeble mortal. Such a situation could only be possible under two conditions — one was that she truly was just a mere mortal; the second possibility would be that she had already achieved an extremely high level of cultivation, possibly Soul Formation or higher, allowing her to return to the simplest and purest of forms, able to control Spirit Qi with such ease that ordinary people would not be able to tell.

source: 他终于静下心来，聚精会神地运转江水诀疗伤。
en_us: He was finally able to calm himself down enough to focus all his attention on circulating essence energy with the Jiang Water Art to heal his injuries.

source: 他绝不能死，也不能伤，否则在床上躺上半月，风月楼找上门来，小奴就危险了。所以今日他必须赢，至少要毫发无损的走下西山。
en_us: He must not wind up dead or severely injured; otherwise should he end up lying in bed for half an entire month, Xiaonu would be in danger should people from the Fengyue Brothel come to find them directly. As such, he had to win that day at all cost, or at least leave the Western Hills completely unscathed.

source: 他胸口之上，不知什么时候，突然多了一只手爪。那爪子没有实形，是黑气组成，却直接穿透了他的胸膛，手心正握着颗还未停止跳动的心脏。
en_us: Out of nowhere, a claw appeared above his chest. The claw did not have a solid form. It was formed out of black smoke yet it directly punctured his chest, the palm of the claw holding onto a heart that was still pumping.

source: 他脑海一转，内心已经猜到了几分，估计这几天他没出江家大院，所以江如虎没办法截他，这才怂恿江恨水来炼丹房。有江恨水在，他就算动手了，刑堂也会给江恨水面子当做不知道的……
en_us: His mind raced as he guessed what had happened in his heart. He estimated that, as he had not left the central courtyard over the past few days, Jiang Ruhu was unable to intercept him and had no choice but to encourage Jiang Henshui to go to the alchemy lab with him. With Jiang Henshui around, even if he did attack Jiang Yi, the disciplinary court would give Jiang Henshui face and pretend to not know what had happened...

source: 他脑海内又浮现那个美丽得让人窒息的黄裳少女，却很快摇了摇头，那个什么学院招生在即，姬听雨既然和江恨水般去武殿闭关了，短时间内肯定不会出来的。
en_us: That breathtakingly beautiful young girl in a yellow dress emerged in his mind again. However, he quicly shook his head, rememebering that with that college imminently about to recruit new students, since Ji Tingyu would have gone into seclusion at the Martial Arts Hall like his relative Jiang Henshui, she would certainly not be out and about in the near future.

source: 他脑海内莫名出现一部无名功法，修炼出变态的黑色元力，如此诡异的事情他根本就不想所有人知道。最重要的是柳长老的死，让他有种淡淡的忧虑，生怕家族牵连重罚他，一名炼丹师对于一个小家族可是至关重要的。
en_us: That a nameless martial arts technique mysteriously appeared in his mind, a technique which could refine the obscenely powerful black essence force - such a bizarre circumstance was something he had absolutely no desire of letting everyone find out. Most importantly, Elder Liu's death had left him with a stinge of anxious concern. He was scared that the Family clan would implicate and severely punish him. After all, an aclhemist was vitally important to a small family clan.

source: 他脑海里顿时出现两个字，想后退却已经来不及了，只觉得领口一紧，直接被狠狠的摔在了地上，下一刻雨点般的拳头哗啦啦的落在了他的脸上，伴着一声声的质问。
en_us: One word immediately surfaced in his mind. He wanted to retreat, but it was too late. He felt his collar tightening and then he was directly slammed ruthlessly onto the ground. The next moment, a series of punches fell upon his face like raindrops along with a string of interrogations.

source: 他脚下又是一颤，这回是真的栽了下去，半会才险险稳住剑，不敢置信的看向沈萤，“你……你怎么知道？”
en_us: Yi Feng lost his footing once again and his bottom really slipped off the sword this time. He caught himself after awhile and turned to Shen Ying in disblief, ”How... how did you know?"

source: 他脚步一滑，快速朝后面退去，但对方是铸鼎境六重武者速度何等的快？身子一闪已经贴了上来，那掌刀划破长空朝江逸的脖子切来。
en_us: Jiang Yi's steps quickly swept backwards, but the speed of a martial artist at the sixth stage of the Cast Tripod Realm was unbelievably fast. Yi Longyu's figure flickered and the materialized near Jiang Yi in an instant, his knifehand sliced through the air and about to strike Jiang Yi's neck.

source: 他脸上虽然没有任何情绪波动，但内心苦涩不已——这管事算是戳中了他的死穴了，一个月他要是拿不出钱，这风月楼一上门，江家刑堂肯定会打断他和江小奴的腿……
en_us: His face revealed no great emotional change, but inside he felt extremely bitter—this housekeeper had hit him right on his Achilles' heel. If he could not deliver the money in a month's time, should the people from Fengyue Brothel pay the family a visit, the Jiang Clan’s Disciplinary Court would undoubtedly break both his and Jiang Xiaonu's legs...

source: 他自言自语的话还没说完，突然头顶一声巨响，一个身影哗啦一下摔了下来。半会才爬了起来，一边拍着身上的灰，一边扬手朝着他的方向打了个招呼。
en_us: Before he could finish speaking to himself, he was hit in the head. A figure fell to the ground. After a moment, the figure crawled back up. The figure began to dust itself and waved in his direction.

source: 他苦苦等待了六千六百年，只为坐在帝位上的那个人！
en_us: 6600 years of bitter waiting, just for that man who sat on the throne!

source: 他落寞的是，如此时刻他的娘亲却不能看到，大长老也生死未卜，如果能亲眼看到他封印有希望解开那该有多少好啊。
en_us: What made him feel lonely was that at this moment his mother could not see him, while Grand Elder remained missing. He thought how good would it be. If only they could see for themselves that there is hope of breaking the seal.

source: 他被堵得一愣，错觉吗？怎么觉得未来剑仙对他有着杀意？都怪姓沈的，一定是她说了啥，剑仙才会对他有误会，这个心机婊。
en_us: Lonemoon was taken aback by his interference. Was this an illusion? Why did it feel like the future Sword Immortal had murderous intent towards him? It was all Shen Ying to blame. She must have said something to cause this misunderstanding between the Sword Immortal and him, this scheming bitch.

source: 他被那铸鼎境三重护卫拍了一掌，尽管他用“摔碑手”挡了一下，但估计骨头被拍裂了，后面又强行动武加上走了这么长一段路伤口被触动，此刻痛得他额头冷汗直冒。
en_us: He was slapped by the guard at the third stage of the Cast Tripod Realm. Even though he blocked the attack with his Wrestling Hand, one could guess that his bones were shattered by the slap. Furthermore, he had to forcefully conduct martial arts techniques, not to mention the long route he had to walk home—all these irritated his wound, leaving him in so much agony that cold sweat kept rolling down his forehead.

source: 他要是回去了，以后不单是物种不同，连世界都不同了。兴许从此再也见不到了，那他……
en_us: If he went back now, they would not just be of different species; they would be of complely different realms. They might never meet again, then he...

source: 他要是进去了，就再也回不来了。再也见不到……
en_us: If he went through the gate, he would not be able to come back. He would never get to see...

source: 他要继续修炼那梦中得到的无名口诀，提炼更多的黑色元力来研究！
en_us: He wanted to continue cultivating the nameless formula from his dream and extract more black essence force for research!

source: 他要见姬听雨其实没特别重要的事，那一日他感觉姬听雨对他似乎有些看重？所以冒然的前来，想看看能不能找她借十两紫金先去风月楼赎回令牌！在他想来，身为姬家的小姐，聚珍阁如此富有，十两紫金对于她来说肯定是九牛一毛，却没想到她竟然不在。
en_us: In truth, he did not have any particularly important reason for wanting to meet Ji Tingyu. That day, he felt that Ji Tingyu regarded him with some importance. As such, he risked coming here, in the hopes of seeing if he could possibly find her and loan ten taels of purple gold so that he could return to the Fengyue Brothel and redeem his command token. From his point of view, being the young mistress of the Ji Family, and with the Pearl Gathering Pavilion being so successful, ten taels of gold would certainly be worth peanuts to her.

source: 他视线突然定在了孤月身上，似是想到了什么，眼里刹时清明了一会，换成了贪婪的眼神，“对了，草木灵，还有千叶草木灵。只要有了那个，就可以再练出升仙丹。”
en_us: Qing Yi's glare focused on Lonemoon. As if he had suddenly realised something, his eyes reflected clarity. Then, they reflected greed. "Oh yes, the Vegetation Spirit… You still have the Thousand Leaves Vegetation Spirit. With that, I can refine an Immortal Formation Pill."

source: 他觉得自从这两师徒出现后，他原本还觉得一帆风顺，天赋超绝的仙途，越来越扯蛋了。感觉自己像老天爷捡来的。
en_us: Ever since Lonemoon met this master and disciple, his neat and clean idea of the immortal future was becoming increasingly messed up. Lonemoon felt as if he had only come this far because heaven was on his side.

source: 他记得那本书是自己十六岁小侄女的，小女孩从小就安静话不多，公主般的小女孩。有阵子却时时刻刻抱着那本书不离手，看了还不止一遍。他好奇之下，就瞄了一眼。
en_us: He recalled that the book was his 16 years old niece's. She had always been a quiet girl from young, a princess-like little girl. There had been a period when she was always hugging that book, reading it countless times. Curious, he had taken a peek.

source: 他话到一半又停住，脸色突然一阵扭曲，眼里闪过满满的挣扎，不到半会脸上的魔痕消退，出现了与之前截然不同的神色，眼里满满都是担忧，看了敞开的大门一眼，似是决定了什么，突然开始双手结印。
en_us: He spoke and stopped. Struggle flickered in his eyes, and his face twisted. The demonic mark on his face soon subsided, and the struggle in his eyes was replaced with deep concern. Glancing at the door that was opened wide, he started to craft a conjured seal with his hands.

source: 他话还没说完，一道烈火突然从地面冲天而起。
en_us: Before Lonemoon could finish speaking, a ball of fire suddenly shot out from the ground.

source: 他话还没说完，下一秒身上却立马响起了一串，只有两人能听到的机械音。
en_us: Before he could finish, his body sounded. Only he and Shen Ying could hear what the system said next.

source: 他话还没说完，却发现刚刚还坐在前面的人，不知道什么时候已经坐回屋里了，正一脸嫌弃的夹着一片绿油油的叶子。
en_us: Before he finished speaking, he realized that the person who had been sitting in front of him had already returned to the house. She was peering at a green leaf in her hand with a look of disgust.

source: 他话还没说完，却感觉身边的身影一矮，下一刻地面咔嚓一声，突然下陷了好几尺。刚还站在他旁边的女子，蹲身一跃，顿时像只离弦的箭一般，瞬间窜上了上空。
en_us: Before he could finish his sentence, he felt the figure beside him crouch down. The next moment he heard a loud boom and the ground subsided a few inches. The woman who was beside him a moment ago had sprung up into the air like an arrow.

source: 他话还没说完，只感觉领口一紧，熟悉眩晕感传来，下一刻浑身巨痛，全身经脉顿时炸裂，地面响起轰隆一声巨响。
en_us: Before he could finish his sentence, he felt his collar tighten and a familiar feeling of dizziness came over him. The next moment he felt terrible pain course through his whole body and all the meridians in his body burst. Then a loud boom came from the ground.

source: 他话还没说完，只见眼前妹子全身暴出大块的肌肉，高形顿时高了好几尺，碗大的拳头直接往他腹部砸了下来。
en_us: Before he could finish, he saw a flurry of muscle before his eyes and found himself flying through the air. Her fist had hit him straight in his core.

source: 他话还没说完，回头却看到众人早已退到了百米开外，还搬出了桌椅，上面隐隐还能看到花生，瓜子，水果之类的物品。一边嗑一边看着这边。
en_us: Before he could complete his sentence, he saw that everyone had already retreated by a hundred meters. They also started carrying out tables and chairs. Spread on the tables were food like peanuts, seeds, fruits. Everyone then sat down to look at him while munching on their tidbits.

source: 他话还没说完，孤月和羿清齐齐后退了一大步。
en_us: Before he could finish, Lonemoon and Yi Qing both took a huge step backward.

source: 他话还没说完，对方却已经凌空飞到了前方，耳边只传来一道清冷的声音，“跟上！”
en_us: Before Yi Feng could finish speaking, the white figure flew forward and shouted, "Follow!"

source: 他话还没说完，就听见哐嚓一声，沈萤手心一紧，那朵晶莹剔透的花朵，瞬间被她捏了个粉碎。
en_us: Before he could finish, he heard a crack. Shen Ying had clenched her fist. The pure, white, delicate flower in her hands was crushed into powder.

source: 他话还没说完，旁边一直没有说话的轩辕家主，轩辕禹突然脚下一软，从椅子上滑了下去，摔在了地上。
en_us: But before he could complete his sentence, the Xuan Yuan Family Patriarch, Xuan Yuanyu, who had been silently sitting beside him all the while suddenly felt his legs go weak. He slipped from his chair and landed on the ground.

source: 他话还没说完，沈萤突然站了起来，一脸认真的道，“历练让带家属的吗？”
en_us: Before he could finish speaking, Shen Ying suddenly stood up, and with a serious expression on her face, she asked, "Can relatives come along on a training expedition?"

source: 他话还没说完，沈萤突然脸色一变，咚的一下放下碗，站了起来。
en_us: Before he could complete his sentence, Shen Ying's facial expression changed. She slammed her bowl down and stood up.

source: 他话还没说完，眼前的人似风一样的刮了出去，消失了。
en_us: Before he could finish speaking, the man in front of him had flown off like a gust of wind.

source: 他话还没说完，突然地面一动，岛屿开始剧烈的摇晃起来，身上一沉，整个地面开始往上拔高，四处都是树木倒塌，滚石掉落的声音。脚下也开始开劈，仿佛地表开始滑落一般。
en_us: Before he could finish, the ground, along with the entire island, began to shake violently. His body suddenly felt much heavier as the whole ground began to rise upwards, into the sky. All around them, trees were falling to the floor and rocks were rolling around. Their legs began to split apart as the ground beneath them began to crack open.

source: 他话还没说完，突然屁股一疼，重心不稳，一头就扎进了界门里，瞬间不见了身影，被触动的界门也迅速合上，消失在眼前。
en_us: Before he could finish, he felt a pain in his butt. He lost his balance and fell headfirst through the realm gate. The next second, he was gone. The realm gate sealed up after he went through it. Bai Ze and the gate disappeared before their very eyes.

source: 他话还没说完，突然脚下白光大盛，阵法瞬间成形，地面一阵晃动，钻出大片的荆棘，朝着陆姓修士拍了过去。
en_us: He had not completed his sentence when all of a sudden, a white glow emerged from beneath him; an array formation took form and the ground shook as a large patch of thistles and thorns grew out and targeted Cultivator Lu.

source: 他话还没说完，突然被塞了满口糕点，刚要瞪旁边的人，额头却被敲了一下。
en_us: Before he could finish speaking, Shen Ying stuffed a pastry into his mouth. He turned to glare at the person beside him, but she knocked his forehead.

source: 他话还没说完，系统音再次响起来。
en_us: Before he could finish, the system sounded once more.

source: 他话还没说完，羿清如离弦的箭一样，就冲向了孤月，连犹豫都没有，招招落在实处，没留半点余地。
en_us: Before the voice could finish, Yi Qing flew toward Lonemoon like an arrow being shot out of its bow. He rained punches and blows onto Lonemoon without hesitation, leaving him no time to retaliate.

source: 他话还没说完，脸上一疼整个仙魂直接被一拳揍了出去，咸鱼一样在地上反复翻滚起来，口里还带着那句未尽的话，“于……于……于……于……”
en_us: Before he could finish, he felt a blow to his face; the immortal soul had received a huge punch. He was sent flying across the room, just like a flying fish. He was still mumbling the remainder of his sentence, "and… and… and…"

source: 他话还没说完，脸色一变，声音尖锐，急喊道，“沈掌门，你别听他的，我才宁子安啊！他都是骗你的……你还记得吗？上次你吃饭还问我要不要吃糕点呢？你相信我，辰戈是真的想夺舍……”
en_us: His face changed and voice became shrewd, shrieking out, " Sect Master Shen, do not believe in his words. I am the real Ning Zi An! He's lying to you! Do you remember asking me whether I wanted desserts when we ate together the other time? Believe me, Chen Ge really wants to take...by force..."

source: 他话还没说完，顿时觉得三道冷嗖嗖的视线齐唰唰戳向他的心口，顿时一僵。
en_us: Before he could finish his sentence, however, he suddenly felt three cold and piercing glares shoot directly towards him, freezing the words in his mouth.

source: 他话音一落，全身的黑气再次暴发，四周瞬间一片漆黑，只余两只赤红的眼睛飘在半空中。
en_us: Just as he finished finished speaking, the black Qi in his whole body erupted again, and the surrounding suddenly turned dark, leaving only two red eyes floating in the air.

source: 他话音一落，突然一道天光从天而降，天光之中缓缓出现一个人影，“只有打败你眼前这个人，方可进入第二层。”
en_us: As soon as the voice finished speaking, a bright line shone down from the sky. A human sillhouette appeared, "If you defeat the person in front of you, you can progress to the third level."

source: 他话音刚落，刚还一脸担心的众妹子，脸色一变，突然齐唰唰的挡在了他面前，异口同声道，“不行！”
en_us: Just as he said this, the expressions on the group of worried girls changed. All of them suddenly stood in front of him, blocking his way, and shouting in unison, "You can't!"

source: 他话音刚落，突然身后却响起个声音。
en_us: But just as he finished saying this, a voice suddenly rang out from behind him.

source: 他话音刚落，迎面半块桂花糕就喷了过来。他一时没注意，被砸了一脸。
en_us: Just as he finished his sentence, half a piece of chrysanthemum cake was spat over. He wasn't alert for a moment and was hit by it right in his face.

source: 他话音刚落，那两面水镜之上就出现了影象，一个是青尹死前的，一个是青亦死前的，可两面水镜出现的都是同一个人的身影，只是一个站立原地脸带惊讶，一个是手握着金色长剑杀气凛然。那是……羿清！
en_us: An image appeared above the two crystallic mirrors; one depicted the moment before Qing Yin's death and the other before Qing Yi's death. But both showed the same person's silhouette, the only difference being that one was standing in shock while the other was holding a long, golden sword with apparent murderous intent. That was… Yi Qing!

source: 他调动灵气再没保留，使出全力，攻击了过去。一时间只见满地的雷光开始汇聚，不到半会，一条雷光组成的长龙出现在了场中。随着对方一动，顿时乱石翻飞，雷光四溢，带着惊人的气势直接冲向了思羽。
en_us: He activated his Spirit Qi, not holding anything back as he attacked. All of a sudden, all that could be seen was a mass of lightning gathering. Out of that lightning formed a long dragon, appearing on the stage. Bits of stone from the stage was blasted everywhere and tongues of lightning lashed the surroundings as the other party moved, making a beeline for Si Yu in an imposing manner.

source: 他走出练功外，却看到所有陪练看他的目光都如看怪物般，似乎很惊疑他能毫发无损走出来。
en_us: He walked out of the technique-practicing room, yet all he saw were the gazes of all the other sparring partners who were staring at him as if they had just seen a monstrous creature. It was as though they were truly shocked to see him walk out without a single injury.

source: 他走回主位上坐下，不到一刻钟，就见一男子从门口而来，身穿一件白色长衫，观骨龄不到二十多岁的样子，浑身带着凌厉的剑气，细一看居然是一名金丹剑修。右手拿着一面黑色的幡旗，隐隐还可以看到里面涌动的鬼气，的确就是传说中的噬魂幡。
en_us: He walked back to the main seat and sat down. Within a quarter of an hour, he saw a man in white robes approaching from the entrance. He looked no more than twenty, his entire body exuding powerful Sword Qi. A closer look revealed that he was actually a Golden Core sword cultivator. He was holding a black flag in his right hand. One could faintly see the Ghost Qi swarming inside the flag. This flag was indeed the legendary Soul Devouring Gonfalon.

source: 他走进屋子内取出上次购买的那身黑袍，套在身上就匆忙出了院子，刚走出去数十丈，他脚步一顿猛然回头，看到远处一个拐角内一道身影一闪后，立即冷笑起来。
en_us: He walked into the house to retrieve the black robes he bought the previous time. Putting the robes on, he hastily dashed out of the courtyard of his house. He had only left his house and walked for several tens of feet when he froze and suddenly turned his head around to look behind his back. Seeing the flash of a figure dart around a corner at a long distance away, he immediately gave a cold laugh.

source: 他越加惊讶，就连在场的各位堂主都频频转头看向殿中的人，实在是因为羿清这个名字，在散修里面，甚至是魔修中太出名了。
en_us: Yi Qing's reply surprised him even further; even the hall masters present all turned to look at the person in the center of the hall. It was no wonder as Yi Qing was such a well-known name among itinerant cultivators and even among fiendish cultivators.

source: 他越加的惊恐，似乎拼尽全力想躲开她的手，偏偏半步都移动不了，只能惊声大叫起来，“不，不要，住手！”
en_us: Yu Haiheng grew even more terrified and attempted to struggle with all his strength to avoid her hand; however, he could not move an inch. All he could do was scream in terror, "No, don't, stop!"

source: 他越想越觉得可能，忍不住频频回头看向沈萤，师父……真是太善良了。
en_us: The more he thought about it, the more plausible it seemed. He could not help but turn back to look at Shen Ying. Master… was indeed too kind.

source: 他跟羿清已经化神，对皮相早就已经看淡了，况且结婴时就有一次重塑身体的机会，以至于高阶修士很少有人看重外貌。所以从来没有想过，专门解决这个问题，而且这么久也已经习惯了她们的样子，并不觉得有哪不对。
en_us: Being Soul Formation cultivators, both Lonemoon and Yi Qing had long lost their attachments to their physical forms. Moreover, there was a chance to reshape the body during Neonate Formation, so few high-level cultivators valued their appearance. Therefore, Lonemoon had never turned his mind to solving this problem and he had also become so used to the girls' appearances that he had not thought there was anything wrong with how they looked.

source: 他踏着迷幻步，不退反进朝前方冲了三尺距离，双膝猛然弯曲，身子后仰，整个人朝左前方滑去，轻松避过了翊凌雪的攻击。
en_us: He used his Psychedelic Step technique and, instead of retreating, ran in a forward direction for a metre before suddenly bending his knees and bending his back backwards. This allowed his whole body so slide in the direction of his forward left-hand side, easuly avoiding Yi Lingxue's incoming attacks.

source: 他身子从地上一跃而起，一个箭步就朝江豹冲去，人在半路一条腿如蛇鞭般扭动，化作残影朝江豹的身子重重的扫去。
en_us: He jumped up from the ground and pounced at Jiang Bao. His leg slithered like a snake whip and swept towards the pathetic figure of Jiang Bao, leaving behind various afterimages.

source: 他身子应声被拍飞出去，重重的撞在了墙上，还连带着把小奴也给推到在地。
en_us: Jiang Yi’s body flew up and slammed heavily into the wall, taking Xiaonu down to the floor with him.

source: 他运转了黑色融合元力的右手提前朝左上角移动了一丝，轻松避过了对方的手掌，化爪为手刀，对着他的腕骨狠狠切去！
en_us: He moved a thread of the combined black essence force, circulating around his right hand, towards the direction of his upper left corner. As such he easily avoided his opponent's palm. Manifesting his fingers like claws and using them in a knife-hand strike, he viciously moved his right hand downwards in a chopping move towards his opponent's wrist!

source: 他还没反应过来，只见本已经力尽的对方身上，突然鼓出一块块健壮的肌肉，连着衣袖都被撑破了，原本娇小的身影，顿时高大了好几圈，一双似是燃着滔天怒火的眼睛，利剑一样戳在了她的身上。
en_us: Before he could react, his opponent who had no more Spirit Qi suddenly flexed her powerful muscles which tore through even her shirt. Her originally petite figure grew larger by a few times. It was as if she was shooting sharp blades from her eyes, fueled by burning fury.

source: 他还没问，一旁的羿清脸色刷的一下就冷了，“不劳白道友了，师父的膳食向来是由我负责的。”
en_us: Before he could ask anything, Yi Qing interrupted with a cold expression, "Not to trouble you, Fellow Daoist. I have always been in charge of Master's meals."

source: 他这也是无奈之举，没有高级丹药依靠他的修炼速度，短时间内根本不可能修炼到铸鼎境二重，敢上西山只有爬着回来。那一日他和江如虎约定十天后西门外见，就是打定主意准备借助高级丹药配合黑色元力快速修炼的……
en_us: However, he committed his act without any other options. Without high-quality elixirs and depending solely on his cultivation speed, he could never practice and reach the second stage of the Cast Tripod Realm within a short amount of time. Should he ever dare to head up the Western Hills, he would have no other future than crawling back home. He arranged to face Jiang Ruhu ten days later at the Western Gate with the predetermined intention of borrowing the power of high-quality elixirs coupled with the black essence force to speedily increase his power...

source: 他这才飞了出去，一边飞向那巨兽的上空，一边双手结印。顿时地面出现了人一般粗壮的滕蔓，朝着背云兽身上捆了上去。
en_us: He flew outtoward the beast and began to form a sea with both of his hands. Suddenly, a vine as thick and sturdy as man flew toward the 背云兽's body.

source: 他这是……被赶出来了吗？
en_us: Had he just been... chased out?

source: 他这话一出口，其它九位妖王顿时露出了赞同的表情，确实与其担惊受怕，不如主动出击。
en_us: Those words immediately gained the approval of the other nine Demon Monarchs. Indeed, rather than to cower in fear, they might as well take the initiative to strike.

source: 他这话一出口，其它弟子纷纷点头补充。
en_us: When he said this, the other disciples nodded and chipped in with their own accounts.
